app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
---
  def show
    @user  = User.find(params[:id])
    @posts = @user.posts.order(created_at: :desc)

UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "ff.hussein"], ["updated_at", "2019-12-24 19:30:24.213404"], ["id", 1]]
---
  def update
    current_user.update(user_params)